.doom.d/config.org
*** TODO make it look nice


** Bookmarks
#+begin_src emacs-lisp
(setq bookmark-file "~/Documents/Emacs/bookmarks")
#+end_src

** Activity Watch
#+begin_src emacs-lisp
(global-activity-watch-mode)
#+end_src

** Games
Stuff that i use for games are here.

*** Kerbal Space Program
#+begin_src emacs-lisp
(require 'ks)
#+end_src
** Social Media
*** Mastodon.el
#+begin_src emacs-lisp
    (setq mastodon-instance-url "https://pleroma.nobodyhasthe.biz"
          mastodon-active-user "nott")

#+end_src
** Rice
#+begin_src emacs-lisp
(use-package! shrface
  :defer t
  :config
  (shrface-basic)
  (shrface-trial)
  (shrface-default-keybindings) ; setup default keybindings
  (setq shrface-href-versatile t))

(use-package! eww
  :defer t
  :init
  (add-hook 'eww-after-render-hook #'shrface-mode)
  :config
 (require 'shrface))

(use-package! nov
  :defer t
  :init
  (add-hook 'nov-mode-hook #'shrface-mode)
  :config
  (require 'shrface)
  (setq nov-shr-rendering-functions '((img . nov-render-img) (title . nov-render-title)))
  (setq nov-shr-rendering-functions (append nov-shr-rendering-functions shr-external-rendering-functions)))

(use-package! anki
  :defer t
  :load-path "~/.emacs.d/lisp/anki/"
  :init
  (add-hook 'anki-mode-hook #'shrface-mode)
  (autoload 'anki "anki")
  (autoload 'anki-browser "anki")
  (autoload 'anki-list-decks "anki")
  :config
  (require 'shrface)
  (setq anki-shr-rendering-functions (append anki-shr-rendering-functions shr-external-rendering-functions))
 (setq sql-sqlite-program "/usr/bin/sqlite3")
 (setq anki-collection-dir "/Users/chandamon/Library/Application Support/Anki2/User 1"))

#+end_src
